Revit 2026 API

# AnalyticalMemberSetCurve Method

---

Sets the curve for the Analytical Member.

**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void SetCurve(
	Curve curve
)
```
```vb
Public Sub SetCurve (
	curve As Curve
)
```
```cpp
public:
void SetCurve(
	Curve^ curve
)
```
```fsharp
member SetCurve :
        curve : Curve -> unit
```

#### Parameters

curve Curve

| Exception | Condition |
| --- | --- |
| ArgumentException | The input curve is not bound. -or- The provided curve is not supported. |
| ArgumentNullException | A non-optional argument was null |

End nodes connection will be lost if the curve changes position. The curve must be bounded. The curve can be:

  * Line
  * Arc
  * Ellipse

#### Reference

AnalyticalMember Class

Autodesk.Revit.DB.Structure Namespace